### SSAFY Start Camp 챗봇 퀘스트

대전_3반_로또 번호 예상 챗봇 개발, https://github.com/JeongJunHui/ssafy_test

#### I. 스펙(Specification)

<b>(1)크롤링 기능</b> 

* 사용자가 '시작'을 전송하면 챗봇은 사용할 수 있는 목록을 출력함(회차조회, 예상번호, 번호등록, 종료)

* '회차조회'를 입력하면 사용자가 원하는 회차의 로또 당첨 번호, 일자, 당첨금과 당첨인원을 출력해준다.

* '예상번호'를 입력하면 챗봇은 모든 로또의 회차를 분석하여 가장 많이 나온 번호를 6개를 추천해준다.

* '번호등록'은 사용자가 원하는 원하는 번호를 등록하여 추후에 이용자들의 번호 등록 성향을 분석한다.

* '종료' 로또 프로그램을 종료함

#### II. 회고(Retrospective)

* 데이터를 분석하는 것이 매우 어려웠음

* 로컬환경을 설정하는 것이 어려웠음

* 생각보다 재밋었음

#### III. 보완 계획(Feedback)

* 분석한 데이터를 그래프로 보여줄 수 있는 환경을 만들고 싶다.

* AI 기능을 구현한다면 로또 번호를 좀 더 다양하게 분석할 수 있을 것이다.
